Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: Example 1. session_set_save_handler() example
es: Ejemplo de session_set_save_handler()

source: See also the session.save_handler configuration directive.
es: ?php function abrir ($save_path, $session_name) {global $sess_save_path, $sess_session_name; $sess_save_path = $save_path; $sess_session_name = $session_name; return(true);} function cerrar() {return(true);} function leer ($id) {global $sess_save_path, $sess_session_name; $sess_file = "$sess_save_path / sess_$id"; if ($fp = @fopen($sess_file, "r")) {$sess_data = fread($fp, filesize($sess_file)); return($sess_data);} else {return(""); / / Debe devolver "" aqu iacute;.}} function escribir ($id, $sess_data) {global $sess_save_path, $sess_session_name; $sess_file = "$sess_save_path / sess_$id"; if ($fp = @fopen($sess_file, "w")) {return(fwrite($fp, $sess_data));} else {return(false);}} function destruir ($id) {global $sess_save_path, $sess_session_name; $sess_file = "$sess_save_path / sess_$id"; return(@unlink($sess_file));} / *********************************************** * ATENCI Oacute;N - Necesitar aacute; implementar alg uacute;n * * tipo de rutinas recolectoras de basura aqu iacute; * *********************************************** / function rb ($maxlifetime) {return true;} session_set_save_handler ("abrir", "cerrar", "leer", "escribir", "destruir", "rb"); session_start(); / / proceed to use sessions normally?

source: session_start() creates a session or resumes the current one based on the current session id that's being passed via a request, such as GET, POST, or a cookie.
es: session_start() crea una sesió (o la continúa basandose en el session id pasado por GET o mediante una cookie).

source: If you want to use a named session, you must call session_name() before calling session_start().
es: Si desea usar una sesión con un nombre en concreto, debe llamar a session_name() antes de llamar a session_start().

source: This function always returns TRUE.
es: Esta función siempre devuelve TRUE.

source: If you are using cookie-based sessions, you must call session_start() before anything is output to the browser.
es: Si está usando sesiones basadas en las cookies, debe llamar a session_start() antes de que haya ninguna salida al navegador.

source: session_start() will register internal output handler for URL rewriting when trans-sid is enabled.
es: session_start() registrará un manejador de salida interno para la reescritura de las URL 's si trans-sid está activado.

source: If a user uses ob_gzhandler or like with ob_start(), the order of output handler is important for proper output.
es: Si un usuario utiliza ob_gzhandler o algo como ob_start(), el orden del manejador de salida es importante para que la salida sea la adecuada.

source: For example, user must register ob_gzhandler before session start.
es: Por ejemplo, el usuario debe registrar ob_gzhandler antes de iniciar la sesión.

source: Use of zlib.output_compression is recommended rather than ob_gzhandler()
es: Se recomienda utilizar zlib.output_compression en lugar de ob_gzhandler

source: session_unregister() unregisters the global variable named name from the current session.
es: session_unregister() desregistra (olvida) la variable global llamada nombre de la sesión actual.

source: This function returns TRUE when the variable is successfully unregistered from the session.
es: Esta función devuelve TRUE cuando la variable es eliminada de la sesión correctamente.

source: If $_SESSION (or $HTTP_SESSION_VARS for PHP 4.0.6 or less) is used, use unset() to unregister a session variable.
es: Nota:

source: This function does not unset the corresponding global variable for name, it only prevents the variable from being saved as part of the session.
es: Esta función no borra la variable global correspondiente a nombre, sólo evita que la variable sea guardada como parte de la sesión.

source: You must call unset() to remove the corresponding global variable.
es: Debe llamar a unset() para eliminar la variable global correspondiente.

source: The session_unset() function frees all session variables currently registered.
es: La función session_unset() elimina y libera el espacio ocupado por todas las variables de la sesión actual registradas.

source: If $_SESSION (or $HTTP_SESSION_VARS for PHP 4.0.6 or less) is used, use unset() to unregister session variable. i.e. $_SESSION = array();
es: Nota:

source: End the current session and store session data.
es: Finaliza la sesión actual y guarda sus datos

source: Session data is usually stored after your script terminated without the need to call session_write_close(), but as session data is locked to prevent concurrent writes only one script may operate on a session at any time.
es: Los datos de la sesió se suelen guardar tras finalizar la ejecución de su script sin necesidad de llamar a session_write_close(), pero como los datos de la sesió están bloqueados para evitar escrituras concurrentes, sólo un script puede trabajar con una sesión a la vez.

source: When using framesets together with sessions you will experience the frames loading one by one due to this locking.
es: Cuando se usan framesets junto con sesiones, podrá comprobar que los frames se cargan uno a uno debido a este bloqueo.

source: You can reduce the time needed to load all the frames by ending the session as soon as all changes to session variables are done.
es: Puede reducir el tiempo necesario para cargar los frames finalizando la sesión tan pronto como haya terminado los cambios a las variables de la sesión.

source: This requires that you place calls to this function prior to any output, including html and head tags as well as any whitespace.
es: setcookie() define una cookie para ser enviada con el resto de la información de la cabecera.

source: If setcookie() successfully runs, it will return TRUE.
es: Las cookies deben enviarse antes de mandar cualquier otra cabecera (esta es una restricción de las cookies, no de PHP).

source: All the arguments except the name argument are optional.
es: Esto requiere que sitúe las llamadas a esta función antes de cualquier etiqueta html o head.

source: You may also replace an argument with an empty string ("") in order to skip that argument.
es: Todos los parámetros excepto name son opcionales.

source: The following table explains each parameter of the setcookie() function, be sure to read the Netscape cookie specification for specifics.
es: Si sólo se especifica el parámetro name, la cookie con ese nombre se borrará del cliente remoto.

source: Assuming the name is' cookiename', this value is retrieved through $_COOKIE['cookiename']
es: También puede sustituir cualquier parámetro por una cadena de texto vacía ("") y saltar así ese parámetro.

source: In otherwords, you' ll most likely set this with the time() function plus the number of seconds before you want it to expire.
es: Los parámetros expire y secure son números enteros y no se pueden saltar con una cadena de texto vacía.

source: If not set, the cookie will expire at the end of the session (when the browser closes).
es: En su lugar utilice un cero (0).

source: If set to '/', the cookie will be available within the entire domain.
es: El parámetro expire es un entero de tiempo típico de UNIX tal como lo devuelven las funciones time() o mktime().

source: The default value is the current directory that the cookie is being set in.
es: El parámetro secure indica que la cookie se debe transmitir única y exclusivamente sobre una conexión segura HTTPS.

source: The domain that the cookie is available.
es: Fallos habituales:

source: The. is not required but makes it compatible with more browsers.
es: Las cookies no se hacen visibles hasta la siguiente carga de una página para la que la cookie deba estar visible.

source: Refer to tail matching in the spec for details.
es: Las llamadas múltiples a setcookie() en el mismo script se ejecutarán en orden inverso.

source: When set to 1, the cookie will only be set if a secure connection exists.
es: Si está intentando borrar una cookie antes de insertar otra, debe situar la llamada de inserción antes de la de borrado.

source: Cookie values also exist in $_REQUEST.
es: A continuación se muestran algunos ejemplos::

source: In our examples below, $TextCookie will exist.
es: Ejemplo 1. setcookie(), ejemplos

source: To test if a cookie was successfully set, check for the cookie on a next loading page before the cookie expires.
es: setcookie( "TestCookie" ,"Test Value"); setcookie("TestCookie",$value,time()+3600); / * expire in 1 hour * / setcookie("TestCookie",$value,time()+3600 ," / ~rasmus / ",".utoronto.ca",1);

source: Cookies must be deleted with the same parameters as they were set with.
es: Tenga en cuenta que el campo value de la cookie se codifica como URL (urlencode) automáticamente cuando envía la cookie.

source: Consider explode() or serialize() to set one cookie with multiple names and values.
es: Cuando ésta se recibe, se descodifica autómaticamente y se asigna a una variable con el mismo nombre que el nombre de la cookie.

source: If you are trying to delete one cookie before inserting another you should put the insert before the delete.
es: Para ver el contenido de nuestra cookie de prueba en un script, simplemente utilice uno de los siguientes ejemplos:

source: Some examples follow how to send cookies:
es: echo $TestCookie; echo $HTTP_COOKIE_VARS["TestCookie"];

source: ?php $value = 'something from somewhere'; setcookie ("TestCookie", $value); setcookie ("TestCookie", $value,time()+3600); / * expire in 1 hour * / setcookie ("TestCookie", $value,time()+3600, "/ ~rasmus /", ".example.com", 1);?
es: También puede utilizar arrays de cookies empleando la notación de array en el nombre de la cookie.

source: To see the contents of our test cookie in a script, simply use one of the following examples:
es: Esto tiene como efecto establecer tantas cookies como elementos de array, pero cuando el script recibe la cookie, se guardan los valores en un array con el nombre de la cookie:

source: When deleting a cookie you should assure that the expiration date is in the past, to trigger the removal mechanism in your browser.
es: setcookie( "cookie[three]", "cookiethree "); setcookie ("cookie[two]", "cookietwo"); setcookie ("cookie[one]", "cookieone "); if (isset ($cookie)) {while (list ($name, $value) = each ($cookie)) {echo "$name == $value br \n";}}

source: ?php / / set the expiration date to one hour ago setcookie ("TestCookie", "", time() - 3600); setcookie ("TestCookie","", time() - 3600, "/ ~rasmus /", ".example.com", 1);?
es: Para obtener más información sobre las cookies, consulte la especificación de cookies de Netscape, que se encuentra en http: / /www.netscape.com / newsref / std / cookie_spec.html.

source: This has the effect of setting as many cookies as you have array elements, but when the cookie is received by your script, the values are all placed in an array with the cookie 's name:
es: Microsoft Internet Explorer 4 con Service Pack 1 no funciona correctamente con las cookies que tienen asociado el parámetro path.

source: Netscape Communicator 4.05 and Microsoft Internet Explorer 3.x appear to handle cookies incorrectly when the path and time are not set.
es: Netscape Communicator 4.05 y Microsoft Internet Explorer 3.x funcionan aparentemente de manera incorrecta cuando no se especifican los parámetros path y time.

source: Hyperwave functions
es: Funciones para Hyperwave

source: E_ERROR, E_PARSE, E_CORE_ERROR, E_CORE_WARNING, E_COMPILE_ERROR and E_COMPILE_WARNING.
es: The example below shows the handling of internal execptions by triggering errors and handling them with a user defined function:

source: The example below shows the handling of internal exceptions by triggering errors and handling them with a user defined function:
es: Ejemplo 1.

source: vector a Array ([0] = 2 [1] = 3 [2] = foo [3] = 5.5 [4] = 43.3 [5] = 21.11) --- - vector b - a warning (b = log(PI) * a) b WARNING / b [1024] Value at position 2 is not a number, using 0 (zero) br Array ([0] = 2.2894597716988 [1] = 3.4341896575482 [2] = 0 [3] = 6.2960143721717 [4] = 49.566804057279 [5] = 24.165247890281) --- - vector c - an error b ERROR / b [512] Incorrect input vector, array of values expected br NULL --- - vector d - fatal error b FATAL / b [256] log(x) for x = 0 is undefined, you used: scale = -2.5 br Fatal error in line 36 of file trigger_error.php, PHP 4.0.2 (Linux) br Aborting... br
es: ?php / / redefine the user error constants - PHP4 only define (FATAL,E_USER_ERROR); define (ERROR,E_USER_WARNING); define (WARNING,E_USER_NOTICE); / / set the error reporting level for this script error_reporting (FATAL + ERROR + WARNING); / / error handler function function myErrorHandler ($errno, $errstr) {switch ($errno) {case FATAL: echo "b FATAL / b [$errno] $errstr br \n"; echo" Fatal error in line ".__LINE__. "of file ".__FILE__; echo", PHP ".PHP_VERSION. "(".PHP_OS .") br \n"; echo "Aborting... br \n"; exit -1; break; case ERROR: echo" b ERROR / b [$errno] $errstr br \n"; break; case WARNING: echo "b WARNING / b [$errno] $errstr br \n"; break; default: echo "Unkown error type: [$errno] $errstr br \n"; break;}} / / function to test the error handling function scale_by_log ($vect, $scale) {if (!is_numeric($scale) _BAR_ _BAR_ $scale = 0) trigger_error("log(x) for x = 0 is undefined, you used: scale = $scale", FATAL); if (!is_array($vect)) {trigger_error("Incorrect input vector, array of values expected", ERROR); return null;} for ($i=0; $i count($vect); $i++) {if (!is_numeric($vect[$i])) trigger_error("Value at position $i is not a number, using 0 (zero)", WARNING); $temp[$i] = log($scale) * $vect[$i];} return $temp;} / / set to the user defined error handler $old_error_handler = set_error_handler("myErrorHandler"); / / trigger some errors, first define a mixed array with a non-numeric item echo "vector a\n"; $a = array(2,3 ,"foo",5.5,43.3,21.11); print_r($a); / / now generate second array, generating a warning echo "----\nvector b - a warning (b = log(PI) * a)\n"; $b = scale_by_log($a, M_PI); print_r($b); / / this is trouble, we pass a string instead of an array echo "----\nvector c - an error\n"; $c = scale_by_log("not array",2.3); var_dump($c); / / this is a critical error, log of zero or negative number is undefined echo "----\nvector d - fatal error\n"; $d = scale_by_log($a, -2.5);?

source: Of particular note is that this value will be 0 if the statement that caused the error was prepended by the @ error-control operator.
es: vector a Array ([0] = 2 [1] = 3 [2] = foo [3] = 5.5 [4] = 43.3 [5] = 21.11) --- - vector b - a warning (b = log(PI) * a) b WARNING / b [1024] Value at position 2 is not a number, using 0 (zero) br Array ([0] = 2.2894597716988 [1] = 3.4341896575482 [2] = 0 [3] = 6.2960143721717 [4] = 49.566804057279 [5] = 24.165247890281) --- - vector c - an error b ERROR / b [512] Incorrect input vector, array of values expected br NULL --- - vector d - fatal error b FATAL / b [256] log(x) for x = 0 is undefined, you used: scale = -2.5 br Fatal error in line 16 of file trigger_error.php, PHP 4.0.1pl2 (Linux) br Aborting... br

source: This function is an alias of stream_set_write_buffer().
es: Si buffer es 0 entonces las operaciones de escritura no usan un buffer intermedio.

source: LC_ALL for all of the below
es: categoria es una cadena que especifica la categoría de las funciones afectadas por el ajuste de localidad:

source: LC_CTYPE for character classification and conversion, for example strtoupper()
es: LC_ALL para todas las funciones

source: LC_NUMERIC for decimal separator (See also localeconv())
es: LC_COLLATE para la comparación de cadenas - aún no incluída en el PHP

source: If locale is the empty string "", the locale names will be set from the values of environment variables with the same names as the above categories, or from "LANG ".
es: LC_CTYPE para la conversión y clasificación de caracteres, como por ejemplo strtoupper()

source: If locale is an array or followed by additional parameters then each array element or parameter is tried to be set as new locale until success.
es: LC_MONETARY para localeconv() - aún no incluída en el PHP

source: This is usefull if a locale is known under different names on different systems or for providing a fallback for a possibly not available locale.
es: LC_NUMERIC para el separador decimal

source: Passing multiple locales is not available before PHP 4.3.0
es: LC_TIME para el formato de fecha y hora con strftime()

source: An invalid category name also causes a warning message.
es: Si localidad es la cadena vacía "", los nombres de localidad se fijarán a partir de las variables de entorno con los mismos nombres de las categorías anteriores, o desde "LANG ".

source: It returns exactly what the system setlocale function returns.
es: Si la localidad es cero o "0", el ajuste de localidad no se ve afectado y sólo se devuelve el ajuste actual.

source: ?php / * Set locale to Dutch * / setlocale (LC_ALL, 'nl_NL'); / * Output: vrijdag 22 december 1978 * / echo strftime ("%A %e %B %Y", mktime (0, 0, 0, 12, 22, 1978)); / * try different possible locale names for german as of PHP 4.3.0 * / $loc_de = setlocale (LC_ALL, 'de_DE@euro', 'de_DE', 'de', 'ge'); echo "Preferred locale for german on this system is '$loc_de'";?
es: Un nombre de categoría no válido también produce un mensaje de aviso.

source: Set the current active configuration setting of magic_quotes_runtime (0 for off, 1 for on).
es: Establece el valor de la configuración activa actual de magic_quotes_runtime. (0 desactivado, 1 activado)

source: See also: get_magic_quotes_gpc() and get_magic_quotes_runtime().
es: Véase también get_magic_quotes_gpc(), get_magic_quotes_runtime().

source: If this is reached, the script returns a fatal error.
es: Establece el número de segundos que se le permite a un script ejecutarse.

source: The default limit is 30 seconds or, if it exists, the max_execution_time value defined in the configuration file.
es: Si éste es alcanzado, el script devuelve un error de tipo fatal.

source: When called, set_time_limit() When called, set_time_limit() restarts the timeout counter from zero.
es: El límite por defecto es 30 segundos o, si existe, el valor max_execution_time definido en el fichero de configuración.

source: In other words, if the timeout is the default 30 seconds, and 25 seconds into script execution a call such as set_time_limit( 20) is made, the script will run for a total of 45 seconds before timing out.
es: Cuando se llama, set_time_limit() reinicia el contador del timeout a cero.

source: There is no workaround other than turning off safe mode or changing the time limit in the configuration file.
es: En otras palabras, si el timeout es el de por defecto de 30 segundos, y después de 25 segundos de ejecución del script se realiza una llamada set_time_limit( 20), el script se ejecutará durante un total de 45 segundos antes de alcanzar su límite.

source: The set_time_limit() function and the configuration directive max_execution_time only affect the execution time of the script itself.
es: Advierta que set_time_limit() no tiene efecto cuando PHP se ejecuta en modo seguro (safe mode).

source: Any time spent on activity that happens outside the execution of the script such as system calls using system(), the sleep() function, database queries, etc. is not included when determining the maximum time that the script has been running.
es: No hay otra opción que que desactivar el modo seguro o cambiar el límite de tiempo en el fichero de configuración.

source: "boolean" (or, since PHP 4.2.0, "bool")
es: Establece el tipo de la varible var como type.

source: "float" (only possible since PHP 4.2.0, for older versions use the deprecated variant "double")
es: Los valores posibles para type son:

source: "array"
es: "integer"

source: "object"
es: "double"

source: $foo = "5bar"; / / string $bar = true; / / boolean settype($foo, "integer"); / / $foo is now 5 (integer) settype($bar, "string"); / / $bar is now "1" (string)
es: Devuelve TRUE si se lleva a cabo con éxito; en otro caso devuelve FALSE.

source: See also gettype(), type-casting and type-juggling.
es: Ver también gettype().

source: shm_attach() returns an id that that can be used to access the System V shared memory with the given key, the first call creates the shared memory segment with mem_size (default: sysvshm.init_mem in the configuration file, otherwise 10000 bytes) and the optional perm-bits (default:
es: shm_attach() devuelve un identificador que puede usarse para acceder a la memoria compartida de SystemV, con la llave dada, la primera llamada creará el segmento de memoria compartida con mem_size de tamaño (por defecto: sysvshm.init_mem en el archivo de configuración, o bien de 10000 bytes) y los bits de permiso mas apropiados (por defecto:

source: Memsize and perm will be ignored.
es: Una segunda llamada a shm_attach() con la misma llave devolvera un id diferente de memoria compartida, pero ambos identificadores acceden a la misma porción de memoria compartida. memsize y perm serán ignorados.

source: shm_detach() disconnects from the shared memory given by the shm_identifier created by shm_attach().
es: shm_detach() finaliza la conexión con la memoria compartida, especificada por el identificador shm_identifier creado con shm_attach().

source: shm_detach() always returns TRUE.
es: Hay que recordar que la memoria compartida aún existe en el sistema Unix, y los datos aún están presentes.

source: The variable is still present in the shared memory.
es: shm_get_var() devuelve la variable con la llave variable_key dada.

source: All variable-types are supported.
es: Inserta o actualiza una variable con una llave variable_key.

source: function foo ($arg_1, $arg_2,..., $arg_n) {echo "Example function.\n"; return $retval;}
es: Una función se define con la siguiente sintaxis:

source: In PHP 3, functions must be defined before they are referenced.
es: function foo ($arg_1, $arg_2,..., $arg_n) {echo "Función de ejemplo.\n"; return $retval;}

source: Except when a function is conditionally defined such as shown in the two examples below.
es: Cualquier instrucción válida de PHP puede aparecer en el cuerpo de la función, incluso otras funiones y definiciones de clases.

source: Its definition must be processed prior to being called.
es: En PHP3, las funciones deben definirse antes de que se referencien.

source: Conditional functions
es: En PHP4 no existe tal requerimiento.

source: ?php function foo() {function bar() {echo "I don't exist until foo() is called.\n";}} / * We can't call bar() yet since it doesn't exist. * / foo(); / * Now we can call bar(), foo()'s processesing has made it accessable. * / bar();?
es: PHP no soporta la sobrecarga de funciones, y tampoco es posible redefinir u ocultar funciones previamente declaradas.

source: PHP 3 does not support variable numbers of arguments to functions, although default arguments are supported (see Default argument values for more information).
es: PHP3 no soporta un número variable de parámetros, aunque sí soporta parámetros por defecto (ver Valores por defecto de de los parámetros para más información).

source: PHP 4 supports both: see Variable-length argument lists and the function references for func_num_args(), func_get_arg(), and func_get_args() for more information.
es: PHP4 soporta ambos: ver Listas de longitud variable de parámetros y las referencias de las funciones func_num_args(), func_get_arg(), y func_get_args() para más información.

source: Function arguments
es: Parámetros de las funciones

source: You must use srand() to seed this function.
es: Esta función mezcla (cambia aleatoriamente el orden de los elementos de) una matriz.

source: Example 1. shuffle() example
es: Ejemplo de shuffle()
